Repository: pwsafe/pwsafe
Catalog: Misc/I18N/ru/omegat_help/omegat/project_save.tmx
Source language: en_us
Languages: ru_ru

source: Sample text to use when deciding what font to be used to display when adding or editing entries
ru_ru: Текст образца для шрифта, используемого в полях диалога добавления/редактирования элемента

source: Save
ru_ru: Сохранить

source: Save N previous passwords per entry
ru_ru: Хранить N предыдущих паролей для элемента

source: Save As
ru_ru: Сохранить как

source: Save a copy of the current safe under a new name or location.
ru_ru: Сохранить текущий контейнер под другим именем или в другом каталоге.

source: Save any changes to the current safe.
ru_ru: Сохранить изменения в текущем контейнере.

source: Save database after every Add or Edit
ru_ru: Сохранять контейнер после вставки или редактирования

source: Save database after every database change
ru_ru: Сохранять контейнер после любых изменений

source: Save database after every databse change
ru_ru: Сохранять контейнер после любых изменений

source: Save database immediately after Edit or Add
ru_ru: Сохранять контейнер после вставки или редактирования

source: Save entry's old passwords when a new password is assigned
ru_ru: Сохранять предыдущее значение при изменении пароля элемента

source: Save immediately
ru_ru: Автоматическое сохранение

source: Save the code of the last Virtual Keyboard used
ru_ru: Идентификатор раскладки экранной клавиатуры, использованной в последний раз

source: Saves any changes made to another safe.
ru_ru: Сохранить изменения в контейнере с другим именем

source: Saves any changes made to the current safe.
ru_ru: Сохранить изменения в текущем контейнере

source: Saxon-HE (Home Edition) (current version 9.3.0.5).
ru_ru: Saxon-HE (Home Edition) (текущая версия 9.3.0.5).

source: Scroll Lock
ru_ru: Scroll Lock (Scroll)

source: Search
ru_ru: Поиск

source: Searching
ru_ru: Поиск

source: Searching for a given text
ru_ru: Поиск указанного текста

source: Searching for an entry
ru_ru: Поиск элемента

source: Security Options
ru_ru: Настройки безопасности

source: Security starts with the user.
ru_ru: Обеспечение безопасности начинается с пользователя.

source: See "IdleTimeout" integer preference for the threshold value in minutes
ru_ru: Время указывается в параметре «IdleTimeout»

source: See http://www.altova.com/altovaxml.html.
ru_ru: См. http://www.altova.com/altovaxml.html.

source: See here for more details.
ru_ru: Для получения дополнительной информации см. здесь.

source: See here for more information about the automatic backups.
ru_ru: Дополнительную информацию об автоматическом резервном копировании можно найти здесь.

source: See here for more information when the results are displayed.
ru_ru: Подробная информация об отображении результатов содержится здесь.

source: See http://saxon.sourceforge.net/.
ru_ru: См. http://saxon.sourceforge.net/.

source: See here for more details on AutoType.
ru_ru: Для получения дополнительной информации об автонаборе см. здесь.

source: See here for more details on autotype.
ru_ru: Для получения дополнительной информации об автонаборе см. здесь.

source: See here for more information on importing text files.
ru_ru: Подробная информация об импорте из текстовых форматов содержится здесь.

source: See http://kernowforsaxon.sourceforge.net/.
ru_ru: См. http://kernowforsaxon.sourceforge.net/.

source: See here for more information on exporting the database to other formats.
ru_ru: Подробная информация о сохранении в другие форматы содержится здесь.

source: See "Manage → Options → Misc.".
ru_ru: См. Управление→Настройки→Разное.

source: See Help entry DCA Values export
ru_ru: Для получения дополнительной информации см. Перечень значений для действия по двойному клику

source: See Note 5 below.
ru_ru: См. примечание 5.

source: See also the description of PWS_PREFSDIR in the Preferences Section.
ru_ru: См. также описание переменной окружения PWS_PREFSDIR в разделе Настройки Password Safe.

source: See note 2 below.
ru_ru: См. примечание 2.

source: See note 3 below.
ru_ru: См. примечание 3.

source: See note 1 below
ru_ru: См. примечание 1

source: See note 2 below
ru_ru: См. примечание 2

source: See note 3 below
ru_ru: См. примечание 3

source: See note 4 below
ru_ru: См. примечание 4

source: See note 4 below.
ru_ru: См. примечание 4.

source: See notes 1 & 2 below.
ru_ru: См. примечания 1 и 2.

source: See the following notes for more options.
ru_ru: Для получения дополнительной информации см. примечания.

source: See the following notes for more information.
ru_ru: Для получения дополнительной информации см. примечания.

source: See the following notes for more information
ru_ru: Для получения дополнительной информации см. примечания.

source: See the next picture
ru_ru: Пример окна с изменениями:

source: See the next picture:
ru_ru: Ниже приведены изображения с примерами.

source: Select
ru_ru: Выбор

source: Select Add Group from the Edit menu
ru_ru: В меню Правка выберите пункт Добавить группу.

source: Select Classic Toolbar or New Toolbar
ru_ru: Выберите Классическая панель инструментов или Современная панель инструментов.

source: Select Edit/View Entry from the Edit menu
ru_ru: В меню Правка нажмите Редактирование/просмотр элемента.

source: Select Edit/View Entry from the Edit menu OR
ru_ru: В меню Правка нажмите Редактирование/просмотр элемента или

source: Select Nested Tree or Flattened List
ru_ru: Выберите Древовидный список или Простой список

source: Select Plain Text...
ru_ru: Выберите Простой текст.

source: Select a different font for displaying entries in the List or Tree views, and for displaying passwords in the Add and Edit Entry dialog boxes.
ru_ru: Данное подменю позволяет задать шрифт для отображения элементов в «простом» и «древовидном» списках, а также шрифт для отображения паролей в диалогах добавления и редактирования элементов.

source: Select a location for the backup file
ru_ru: Выберите расположение файла резервной копии.

source: Select a password entry
ru_ru: Выберите элемент с необходимым именем пользователя и паролем.

source: Select the Manage->Yubikey... menu item.
ru_ru: Выберите пункт меню «Сервис→YubiKey...».

source: Select the entry to edit from the list
ru_ru: Выберите элемент для редактирования.

source: Select the entry to edit from the list then:
ru_ru: Выделите элемент для редактирования.

source: Select the group and press the shortcut to rename (default F2) and overtype the group name.
ru_ru: Выделите группу и нажмите комбинацию клавиш для переименования (по умолчанию F2), после чего укажите новое имя.

source: Select the password entry to edit from the list
ru_ru: Выберите элемент для редактирования.

source: Select the password icon from the tool bar
ru_ru: Щёлкните на панели инструментов по значку, соответствующему паролю

source: Select the text file to import.
ru_ru: Выберите текстовый файл для импорта.

source: Select the user name icon from the tool bar
ru_ru: Щёлкните на панели инструментов по значку, соответствующему имени пользователя

source: Select the user name/password entry you wish to use
ru_ru: Выберите имя пользователя/пароль, которые собираетесь использовать.

source: Selecting "Advanced field selection" will display this Wizard page to allow you to export only some of the entries, based on the text in specified fields, and/or specify which fields are to be exported.
ru_ru: Если поставить флажок «Расширенные условия отбора», будет доступна ещё одна страница, на которой можно задать ограничения по значению полей элемента, а также указать поля для экспорта.

source: Selecting 'Back' will return to the first Wizard tab where you may unselect the "Advanced field selection" if you wish to export all entries and all their fields.
ru_ru: Если вы передумаете, для экспорта всех элементов можно нажать кнопку «Назад» и снять флажок «Расширенные условия отбора».

source: Selecting Generate pronounceable passwords will cause Password Safe to generate a "nonsense" word that should be pronounceable, such as "ingstria", "ringsony", etc.
ru_ru: Выбор Создавать произносимые пароли приведёт к тому, что Password Safe будет создавать бессмысленные, но произносимые на английском языке слова, например, «ingstria», «ringsony», и пр.

source: Selecting Options... brings up a tabbed dialog where many of Password Safe's settings can be viewed and edited.
ru_ru: При выборе данного пункта будет отображён диалог, с помощью которого можно просматривать и редактировать настройки Password Safe.

source: Selecting Password Rules
ru_ru: Выбор правил создания паролей

source: Selecting more than one entry is natively supported in the List view but not in the Tree view.
ru_ru: Выделение нескольких элементов поддерживается в простом списке и не поддерживается в древовидном.

source: Selecting this checkbox and setting the corresponding value defines the default password retention for new entries.
ru_ru: Установка данного флажка задаёт количество сохраняемых по умолчанию паролей для новых элементов.

source: Selecting this option and clicking on the Apply button will cause the registry settings to be cleared.
ru_ru: Настройки будут удалены из реестра после установки флажка и нажатия кнопки Применить.

source: Selecting this option brings up the Change Safe Password dialog.
ru_ru: Изменение мастер-пароля для контейнера.

source: Selecting this option disables all other check boxes.
ru_ru: Установка данного флажка блокирует другие настройки политики.

source: Selecting this option, disables all other check boxes.
ru_ru: Установка данного флажка блокирует другие настройки политики.

source: Send an email.
ru_ru: Отправить письмо

source: Send email
ru_ru: Отправить письмо

source: Set Database ID
ru_ru: Установка номера контейнера

source: Set import settings and parameters for the text file being imported
ru_ru: Укажите параметры импорта из данного файла.

source: Set the New Safe Combination (and the Confirmation) to the desired value.
ru_ru: Введите новый пароль и его подтверждение в соответствующие поля.

source: Set the New Safe Combination (and the Confirmation) to the desired value: Blank to remove the password, or a new password to add or replace the password.
ru_ru: В полях «Новый пароль» и «Подтверждение» установите пустое значение, чтобы отключить проверку пароля, или новый пароля чтобы изменить или добавить проверку пароля.

source: Set up the Safe Combination as follows:
ru_ru: Установите мастер-пароль.

source: Set/Edit Filter is a good way to work with filters for a one-time task.
ru_ru: Пункт меню «Создать/Редактировать фильтр» удобен для «одноразовых» фильтров.

source: Sets up part of the password.
ru_ru: Показать часть пароля

source: Setting a Password Policy
ru_ru: Политика создания паролей

source: Setting an ID of zero will remove the number from the image.
ru_ru: Установка нулевого идентификатора убирает номер со значка.

source: Setting this option will cause Password Safe to open databases in read-only mode by default.
ru_ru: Если помечено, Password Safe будет по умолчанию отрывать контейнеры в режиме «только чтение».

source: Setting up a Safe Combination with YubiKey
ru_ru: Установка мастера-пароля и YubiKey

source: Shift key
ru_ru: Клавиша Shift

source: Shortcut
ru_ru: Ярлык

source: Shortcut Base Entry
ru_ru: Исходный элемент для ярлыка

source: Shortcut Keys
ru_ru: Комбинации клавиш

source: Shortcut keys
ru_ru: Комбинации клавиш

source: Shortcuts
ru_ru: Ярлыки

source: Shortcuts and Aliases
ru_ru: Ярлыки и псевдонимы

source: Shortcuts tab
ru_ru: Комбинации клавиш

source: Should you specify any restrictions or field selection but do not want to use them this time, then either press the Cancel button or press the OK button and uncheck the Advanced button on the Find Toolbar.
ru_ru: В случае, если вы уже задали какие-либо условия, или ограничили список полей, но не хотите использовать их в данный момент, нажмите кнопку «Отмена» или «ОК», а затем кнопку «Расширенные» на панели поиска (чтобы она перестала быть утопленной).

source: Should you specify any restrictions or field selection but do not want to use them this time, then press the Back button and uncheck the "Advanced field selection criteria" on the "Wizard Select Database or File" page.
ru_ru: В случае, если вы уже задали какие-либо условия, или ограничили список полей, но не хотите использовать их в данный момент, нажмите кнопку «Назад» и снимите флажок «Расширенные условия отбора».

source: Show Dragbar
ru_ru: Отображать панель Dragbar

source: Show Grid Lines in List View
ru_ru: Показать сетку списка

source: Show Notes as ToolTips in Tree & List Views
ru_ru: Показывать заметки во всплывающей подсказке

source: Show Notes in Add and Edit
ru_ru: Отображение заметок при добавлении и редактировании

source: Show Notes in Edit
ru_ru: Показывать заметки при редактировании

source: Show Password in Tree View
ru_ru: Показывать пароль в дереве

source: Show Passwords
ru_ru: Показать пароль

source: Show Toolbar
ru_ru: Отображать панель инструментов

source: Show Username in Tree View
ru_ru: Показывать имя пользователя в дереве

source: Show an entry's Notes as a tool tip in both Tree and List views (only the first 250 characters will be displayed)
ru_ru: Показывать заметки во всплывающей подсказке (только первые 250 символов)

source: Show entries with Expiry dates
ru_ru: Показать элементы с заданными датами истечения пароля

source: Show grid lines in list view
ru_ru: Отображать сетку списка

source: Show groups first in tree view
ru_ru: Размещать группы вверху дерева

source: Show password in Add & Edit
ru_ru: Показывать пароль при добавлении и редактировании

source: Show the Find toolbar when Password Safe starts.
ru_ru: При запуске Password Safe отображать панель поиска

source: Show unsaved changes
ru_ru: Показать несохранённые изменения

source: Shutdown
ru_ru: Выключение компьютера

source: Similarly, 'Delete Entry' is the same as 'Delete Group' and 'Rename Entry' is the same as 'Rename Group'.
ru_ru: Аналогично, «Удалить элемент» совпадает с «Удалить группу», а «Переименовать элемент» совпадает с «Переименовать группу».

source: Similarly, an entry keyboard shortcut may not be in use when added to an entry but could become conflicted if you later customises the menu shortcuts or changes the language.
ru_ru: Аналогично, конфликта может не быть при назначении горячих клавиш, но он может произойти позже, если вы измените язык или комбинации клавиш для пунктов меню.

source: Similarly, when one or more entries are dragged from another database and dropped into the current database except "Drag - datetime" will be used to make the Named Password Policy unique.
ru_ru: Аналогично, при перетаскивании одного или нескольких элементов из одного контейнера в другой, для обеспечения уникальности будет использоваться фраза «Перетянуто дата/время».

source: Simply hover your mouse pointer over the icon and a small tip will appear.
ru_ru: Для отображения подсказки достаточно навести мышку на значок.

source: Since square and curly brackets are used to delimit the username and password, it is NOT possible to rename an entry in place (e.g. using F2) if the title, username (if displayed) or password (if displayed) contain any of these characters.
ru_ru: Так как квадратные и фигурные скобки используются для отделения имени пользователя и пароля, невозможно изменить элемент переименованием (например, по кнопке F2), если отображаемое имя или пароль содержат одну из таких скобок.

source: Since the Enter key is used to set the shortcut value, it cannot be assigned to any function.
ru_ru: Так как клавиша Enter используется для задания горячих клавиш, её нельзя назначить на то или иное действие.

source: Since the color of the Windows Taskbar and Notification Area varies across versions of Windows, you can set the color of the text for the best contrast on your system.
ru_ru: Можно изменить цвет текста индикатора, чтобы улучшить его видимость для используемой версии Windows и темы оформления.

source: Since the information stored in a password database is usually both sensitive and important, Password Safe provides several mechanisms for backing up and restoring password databases.
ru_ru: Так как информация, хранящаяся в контейнере с паролями обычно является важной, Password Safe предоставляет несколько способов резервного копирования и восстановления контейнеров.

source: Since the whole Notes field is enclosed between double quotation marks, this character is prohibited from being selected as the multi-line delimiter.
ru_ru: Так как всё содержимое поля «Заметки» заключено в двойные кавычки, это символ нельзя использовать в качестве разделителя строк.

source: Since this effectively disables all applications, it will automatically timeout after about two minutes of inactivity.
ru_ru: Т. к. после переключения на «Защищённый рабочий стол» блокируется возможность взаимодействия с другими приложениями, «Защищённый рабочий стол» автоматически закрывается при отсутствии активности в течение двух минут.

source: Size of the columns in the Manage → Options → Shortcuts tab
ru_ru: Размеры столбцов на вкладке Сервис→Настройки→Комбинации клавиш

source: So you can build your desired master password.
ru_ru: Таким образом можно ввести любой желаемый мастер-пароль

source: So your autotype string could look like
ru_ru: В результате, строка автонабора может получиться такой

source: So, if there is only one entry in the database with title 't', then [t] would be sufficient - since title is mandatory and only one item is given, it is assumed to be the title.
ru_ru: То есть, если в контейнере лишь один элемент с заголовком «t», то в качестве пароля псевдонима можно указать [t] (если указано только одно значение, то считается, что это заголовок, т. к. он является обязательным).

source: Some institutions require only lower case characters while others will demand that an upper case character, number, and special character be used, as well as a specified minimum length.
ru_ru: В некоторых случаях требуется создавать пароли, содержащие только строчные буквы, в других требуется наличие прописных букв, цифр и спецсимволов, а также указание минимальной длины.

source: Some key combinations may be different on these keyboards - for example on a UK keyboard the # symbol has its own key (with the tilde ~) but on a US keyboard it is above the 3 key (i.e., Shift+3).
ru_ru: Некоторые комбинации клавиш могут отличаться, например, на клавиатуре с английской раскладкой символ «#» находится на клавише с тильдой «~», а на американской раскладке он находится на той же клавише, что и символ 3 (для вызова используется Shift+3).

source: Some key combinations may be different on these keyboards - for example on a UK keyboard the the # symbol has its own key (with the tilde ~) but on a US keyboard it is above the 3 key (i.e. Shift+3).
ru_ru: Некоторые комбинации клавиш могут отличаться, например, на клавиатуре с английской раскладкой символ «#» находится на клавише с тильдой «~», а на американской раскладке он находится на той же клавише, что и символ 3 (для вызова используется Shift+3).

source: Some keys are reserved by Windows - for example Ctrl+Alt+Delete; Tab; Shift+Tab; Alt+Tab; Alt+Shift+Tab etc.
ru_ru: Некоторые комбинации клавиш зарезервированы ОС Windows, например, Ctrl+Alt+Delete, Tab, Shift+Tab, Alt+Tab, Alt+Shift+Tab и др.

source: Some of the configurable preferences are security related, and storing them in an open repository such as the Windows registry may enable an attacker to gain access to the database (for example, if the attacker were to disable the locking of the database after an inactivity timeout, the user would assume the database was safely locked while out to lunch, whereas the attacker could then access it at her convenience).
ru_ru: Некоторые настройки связаны с обеспечением безопасности, и хранение их в доступных местах может привести к получению злоумышленником несанкционированного доступа к контейнеру (например, если он отключит блокировку контейнера по истечении указанного времени, а пользователь не заметит этого и уйдёт на обед).

source: Some sites remember the username even when the user does not want it to or user forgets to clear the don't remember username and, because of browser cookies, it is remembered anyway, or if login fails for whatever reason on the first attempt the username would still remain.
ru_ru: Некоторые сайты запоминают имя пользователя, даже если он об этом не просил; пользователь мог забыть поставить флажок «не запоминать имя пользователя»; имя могло быть запомнено и подставлено браузером; или, если предыдущая попытка входа не удалась, поле может содержать ранее введённое имя.

source: Some validation is always required e.g. uniqueness of the entry's ID and the group/title/username combination.
ru_ru: Есть несколько обязательных проверок, которые производятся независимо от этого параметра, например проверка уникальности идентификатора элемента и сочетаний Группа/Заголовок/Имя пользователя.

source: Space
ru_ru: Пробел

source: Space bar
ru_ru: Пробел

source: Special Characters
ru_ru: Специальные символы

source: Special command line parameters for the alternate browser, if specified
ru_ru: Параметры командной строки для альтернативного браузера

source: Special command line parameters for the alternate browser, if specified.
ru_ru: Параметры командной строки для альтернативного браузера

source: Special command line parameters for the alternate text editor, if specified.
ru_ru: Параметры командной строки для альтернативного текстового редактора

source: Specifying --do-tall or --do-wide forces the choice, and --do-auto resets the system to use its internal logic.
ru_ru: --do-tall принудительно устанавливает «высокий» вариант, --do-wide — «широкий», а --do-auto сбрасывает предпочтения и возвращает автоматический выбор.

source: Specifying a colon without a value implies an empty field, e.g. [g:t:] means an entry with title 't' in group 'g' and with no user name value and [:t:] specifies an entry with title 't' in the root with no user name value, etc.
ru_ru: Указание двоеточия без значения равносильно пустому полю, например, [g:t:] указывает на элемент с заголовком «t» в группе «g» без имени пользователя, а [:t:] равносильно элементу «t» без имени пользователя, находящемуся в корне дерева.

source: Specifying a colon without a value implies an empty field, e.g. [g:t:] says entry with title 't' in group 'g' and with no user name value and [:t:] says entry with title 't' in the root with no user name value etc.
ru_ru: Указание двоеточия без значения равносильно пустому полю, например, [g:t:] указывает на элемент с заголовком «t» в группе «g» без имени пользователя, а [:t:] равносильно элементу «t» без имени пользователя, находящемуся в корне дерева.

source: Start Password Safe at Login
ru_ru: Запускать Password Safe при входе в систему

source: Storing Filters
ru_ru: Сохранение фильтров

source: Storing Passwords
ru_ru: Хранение паролей

source: Storing filters externally is a good way to share filters across databases, whereas storing them as part of the database ensures that potentially sensitive information in the filters' definitions is protected.
ru_ru: Внешние фильтры удобны тем, что их можно использовать в нескольких контейнерах, а фильтры сохранённые внутри контейнера не разглашают потенциально важную информацию, заданную в условиях (части имён, паролей и пр.).

source: Subsets of the database
ru_ru: Часть контейнера

source: Subviews
ru_ru: Стандартные фильтры

source: Such a keyboard is available as a virtual keyboard.
ru_ru: Дополнительные раскладки также доступны через экранную клавиатуру.

source: Such backups are called intermediate backups, and are described here.
ru_ru: Такие резервные копии называются промежуточными и описываются здесь.

source: Suggestions:
ru_ru: Предложения:

source: Summary
ru_ru: Краткое описание

source: Support
ru_ru: Поддержка
